GD32-MCU-IOT/gd32_zephyr/drivers/can/can_gd32_v2.c
/*
 * Copyright (c) 2026, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/drivers/can/transceiver.h>
#include <zephyr/drivers/clock_control/gd32.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/sys/util.h>
#include <string.h>
#include <zephyr/kernel.h>
#include <soc.h>
#include <errno.h>
#include <stdbool.h>
#include <zephyr/drivers/can.h>
#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
#include "can_gd32_v2.h"

LOG_MODULE_REGISTER(can_gd32_v2, CONFIG_CAN_LOG_LEVEL);

#define DT_DRV_COMPAT gd_gd32_can_v2

#define SP_IS_SET(inst) DT_INST_NODE_HAS_PROP(inst, sample_point) ||

/* Macro to exclude the sample point algorithm from compilation if not used
 * Without the macro, the algorithm would always waste ROM
 */
#define USE_SP_ALGO (DT_INST_FOREACH_STATUS_OKAY(SP_IS_SET) 0)

#define SP_AND_TIMING_NOT_SET(inst)                                                                \
	(!DT_INST_NODE_HAS_PROP(inst, sample_point) &&                                             \
	 !(DT_INST_NODE_HAS_PROP(inst, prop_seg) && DT_INST_NODE_HAS_PROP(inst, phase_seg1) &&     \
	   DT_INST_NODE_HAS_PROP(inst, phase_seg2))) ||

#if DT_INST_FOREACH_STATUS_OKAY(SP_AND_TIMING_NOT_SET) 0
#error You must either set a sampling-point or timings (phase-seg* and prop-seg)
#endif

static void can_gd32_signal_tx_complete(const struct device *dev, struct can_gd32_mailbox *mb,
					int status)
{
	can_tx_callback_t callback = mb->tx_callback;

	if (callback != NULL) {
		callback(dev, status, mb->callback_arg);
		mb->tx_callback = NULL;
	}
}

static int can_gd32_get_state(const struct device *dev, enum can_state *state,
			      struct can_bus_err_cnt *err_cnt)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	can_error_counter_struct hal_err_cnt;

	if (err_cnt != NULL) {
		can_error_counter_get(can, &hal_err_cnt);
		err_cnt->tx_err_cnt = hal_err_cnt.tx_errcnt;
		err_cnt->rx_err_cnt = hal_err_cnt.rx_errcnt;
	}

	if (state != NULL) {
		if (!data->common.started) {
			*state = CAN_STATE_STOPPED;
		} else {
			switch (can_error_state_get(can)) {
			case CAN_ERROR_STATE_ACTIVE:
				can_error_counter_get(can, &hal_err_cnt);
				if ((hal_err_cnt.tx_errcnt < 96U) &&
				    (hal_err_cnt.rx_errcnt < 96U)) {
					*state = CAN_STATE_ERROR_ACTIVE;
				} else {
					*state = CAN_STATE_ERROR_WARNING;
				}
				break;
			case CAN_ERROR_STATE_PASSIVE:
				*state = CAN_STATE_ERROR_PASSIVE;
				break;
			case CAN_ERROR_STATE_BUS_OFF:
				*state = CAN_STATE_BUS_OFF;
				break;
			default:
				*state = CAN_STATE_ERROR_ACTIVE;
				break;
			}
		}
	}

	return 0;
}

static void can_gd32_state_change(const struct device *dev)
{
	struct can_gd32_data *data = dev->data;
	struct can_bus_err_cnt err_cnt;
	enum can_state state;

	(void)can_gd32_get_state(dev, &state, &err_cnt);

	if (state != data->state) {
		data->state = state;
		if (data->common.state_change_cb != NULL) {
			data->common.state_change_cb(dev, state, err_cnt,
						     data->common.state_change_cb_user_data);
		}
	}
}

static void can_gd32_error_isr(const struct device *dev)
{
	const struct can_gd32_config *cfg = dev->config;
	uint32_t can = cfg->reg;

	if (can_flag_get(can, CAN_FLAG_STUFF_ERR) == SET) {
		CAN_STATS_STUFF_ERROR_INC(dev);
		can_flag_clear(can, CAN_FLAG_STUFF_ERR);
	}
	if (can_flag_get(can, CAN_FLAG_FORM_ERR) == SET) {
		CAN_STATS_FORM_ERROR_INC(dev);
		can_flag_clear(can, CAN_FLAG_FORM_ERR);
	}
	if (can_flag_get(can, CAN_FLAG_CRC_ERR) == SET) {
		CAN_STATS_CRC_ERROR_INC(dev);
		can_flag_clear(can, CAN_FLAG_CRC_ERR);
	}
	if (can_flag_get(can, CAN_FLAG_ACK_ERR) == SET) {
		CAN_STATS_ACK_ERROR_INC(dev);
		can_flag_clear(can, CAN_FLAG_ACK_ERR);
	}
	if (can_flag_get(can, CAN_FLAG_BIT_DOMINANT_ERR) == SET) {
		CAN_STATS_BIT1_ERROR_INC(dev);
		can_flag_clear(can, CAN_FLAG_BIT_DOMINANT_ERR);
	}
	if (can_flag_get(can, CAN_FLAG_BIT_RECESSIVE_ERR) == SET) {
		CAN_STATS_BIT0_ERROR_INC(dev);
		can_flag_clear(can, CAN_FLAG_BIT_RECESSIVE_ERR);
	}

	/* Clear the error-summary interrupt flag (ERR1 bit 1). This bit must
	 * be explicitly cleared after handling all sub-error flags; failing to
	 * do so leaves the interrupt asserted and causes an infinite ISR
	 * re-entry loop that freezes the CPU.
	 */
	can_interrupt_flag_clear(can, CAN_INT_FLAG_ERR_SUMMARY);

	can_gd32_state_change(dev);
}

static void can_gd32_wake_up_isr(const struct device *dev)
{
	ARG_UNUSED(dev);
}

static void can_gd32_fast_error_isr(const struct device *dev)
{
	ARG_UNUSED(dev);
}

static void can_gd32_rx_mailbox_rearm(uint32_t can, uint32_t mb_idx)
{
	can_mailbox_descriptor_struct rx_msg;

	memset(&rx_msg, 0, sizeof(rx_msg));
	rx_msg.code = CAN_MB_RX_STATUS_EMPTY;
	can_mailbox_config(can, mb_idx, &rx_msg);
}

static void can_gd32_rx_mailbox_isr(const struct device *dev)
{
	struct can_gd32_data *data = dev->data;
	const struct can_gd32_config *cfg = dev->config;
	uint32_t can = cfg->reg;

	for (uint8_t mb = 0U; mb < CAN_GD32_RX_MAILBOX_NUM; mb++) {
		uint32_t mb_idx = CAN_GD32_RX_MAILBOX_START + mb;
		struct can_frame frame;
		can_mailbox_descriptor_struct rx_msg;

		if (can_interrupt_flag_get(can, CAN_INT_FLAG_MB0 + mb_idx) != SET) {
			continue;
		}

		memset(&frame, 0, sizeof(frame));
		memset(&rx_msg, 0, sizeof(rx_msg));
		rx_msg.data = frame.data_32;

		if (can_mailbox_receive_data_read(can, mb_idx, &rx_msg) != SUCCESS) {
			can_interrupt_flag_clear(can, CAN_INT_FLAG_MB0 + mb_idx);
			continue;
		}

		frame.id = rx_msg.id;
		frame.dlc = rx_msg.dlc;
		if (rx_msg.ide) {
			frame.flags |= CAN_FRAME_IDE;
		}
		if (rx_msg.rtr) {
			frame.flags |= CAN_FRAME_RTR;
		}
#ifdef CONFIG_CAN_GD32_CAN_V2_FD
		if (rx_msg.fdf) {
			frame.flags |= CAN_FRAME_FDF;
		}
		if (rx_msg.brs) {
			frame.flags |= CAN_FRAME_BRS;
		}
		if (rx_msg.esi) {
			frame.flags |= CAN_FRAME_ESI;
		}
#endif /* CONFIG_CAN_GD32_CAN_V2_FD */
#ifdef CONFIG_CAN_RX_TIMESTAMP
		frame.timestamp = rx_msg.timestamp;
#endif

		can_interrupt_flag_clear(can, CAN_INT_FLAG_MB0 + mb_idx);

