GD32-MCU-IOT/gd32_zephyr/drivers/can/can_gd32_v2.c
		if ((frame.flags & CAN_FRAME_RTR) == 0 || IS_ENABLED(CONFIG_CAN_ACCEPT_RTR)) {
			for (int i = 0; i < CONFIG_CAN_GD32_CAN_V2_MAX_ID_FILTER; i++) {
				if (data->rx_cb[i] != NULL &&
				    can_frame_matches_filter(&frame, &data->filters[i])) {
					data->rx_cb[i](dev, &frame, data->cb_arg[i]);
				}
			}
		}

		can_gd32_rx_mailbox_rearm(can, mb_idx);
	}
}

static void can_gd32_tx_isr(const struct device *dev)
{
	struct can_gd32_data *data = dev->data;
	const struct can_gd32_config *cfg = dev->config;
	uint32_t can = cfg->reg;
	bool bus_off = (CAN_ERR1(can) & CAN_ERR1_BOF) != 0U;
	int status;

	for (uint8_t i = 0U; i < CAN_GD32_TX_MAILBOX_NUM; i++) {
		bool done = can_interrupt_flag_get(
				    can, CAN_INT_FLAG_MB0 + CAN_GD32_TX_MAILBOX_START + i) == SET;

		if (!done && !bus_off) {
			continue;
		}

		status = done ? 0 : (bus_off ? -ENETUNREACH : -EIO);
		can_gd32_signal_tx_complete(dev, &data->mb[i], status);
		can_interrupt_flag_clear(can, CAN_INT_FLAG_MB0 + CAN_GD32_TX_MAILBOX_START + i);
		data->tx_mb_used[i] = 0U;

		if (done) {
			k_sem_give(&data->tx_sem);
		}
	}
}

static void can_gd32_message_buffer_isr(const struct device *dev)
{
	can_gd32_tx_isr(dev);
	can_gd32_rx_mailbox_isr(dev);
}

static void can_gd32_bus_off_isr(const struct device *dev)
{
	const struct can_gd32_config *cfg = dev->config;
	uint32_t can = cfg->reg;

	can_gd32_tx_isr(dev);
	can_flag_clear(can, CAN_FLAG_BUSOFF);
	can_gd32_state_change(dev);
}

#define CAN_GD32_MODE_TIMEOUT 100000U

static void can_gd32_freeze(uint32_t can)
{
	uint32_t tmo = CAN_GD32_MODE_TIMEOUT;

	CAN_CTL0(can) &= ~CAN_CTL0_CANDIS;
	CAN_CTL0(can) |= CAN_CTL0_HALT | CAN_CTL0_INAMOD;

	while (((CAN_CTL0(can) & (CAN_CTL0_NRDY | CAN_CTL0_INAS)) !=
		(CAN_CTL0_NRDY | CAN_CTL0_INAS)) &&
	       (tmo != 0U)) {
		tmo--;
	}
}

/*
 * Bring the controller out of inactive / freeze mode. Same bounded-wait
 * rationale as can_gd32_freeze(): in loopback mode INAS may not clear, so a
 * timeout is not treated as fatal.
 */
static void can_gd32_unfreeze(uint32_t can)
{
	uint32_t tmo = CAN_GD32_MODE_TIMEOUT;

	CAN_CTL0(can) &= ~(CAN_CTL0_HALT | CAN_CTL0_INAMOD);

	while ((CAN_CTL0(can) & CAN_CTL0_INAS) && (tmo != 0U)) {
		tmo--;
	}
}

static int can_gd32_enter_init_mode(uint32_t can)
{
	can_gd32_freeze(can);
	return 0;
}

/*
 * Wake the controller from the reset / disable state. After a hard reset the
 * FlexCAN-style core is in disable mode (CANDIS=1); clearing the disable bit
 * and halting it settles the core before the real enter_init_mode below.
 */
static void can_gd32_leave_sleep_mode(uint32_t can)
{
	can_gd32_freeze(can);
}

static can_operation_modes_enum can_gd32_mode_to_hal(can_mode_t mode)
{
	if ((mode & CAN_MODE_LOOPBACK) != 0) {
		return CAN_LOOPBACK_SILENT_MODE;
	}

	if ((mode & CAN_MODE_LISTENONLY) != 0) {
		return CAN_MONITOR_MODE;
	}

	return CAN_NORMAL_MODE;
}

static int can_gd32_get_capabilities(const struct device *dev, can_mode_t *cap)
{
	ARG_UNUSED(dev);

	*cap = CAN_MODE_NORMAL | CAN_MODE_LOOPBACK | CAN_MODE_LISTENONLY;

#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	*cap |= CAN_MODE_FD;
#endif

	if (IS_ENABLED(CONFIG_CAN_MANUAL_RECOVERY_MODE)) {
		*cap |= CAN_MODE_MANUAL_RECOVERY;
	}

	return 0;
}

static int can_gd32_start(const struct device *dev)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	int ret = 0;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (data->common.started) {
		ret = -EALREADY;
		goto unlock;
	}

	if (cfg->common.phy != NULL) {
		ret = can_transceiver_enable(cfg->common.phy, data->common.mode);
		if (ret != 0) {
			LOG_ERR("failed to enable CAN transceiver (err %d)", ret);
			goto unlock;
		}
	}

	/*
	 * Bring the controller online the first time only. Once it has left
	 * freeze mode and synchronised, we keep it online across stop()/start()
	 * cycles (stop() is tracked purely in software). This avoids the bus-less
	 * loopback re-synchronisation problem, where a halted core can never
	 * clear INAS again.
	 */
	if (!data->hw_online) {
		can_gd32_unfreeze(can);
		data->hw_online = true;
	}

	data->common.started = true;
unlock:
	k_mutex_unlock(&data->inst_mutex);
	return ret;
}

static int can_gd32_stop(const struct device *dev)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	int ret = 0;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (!data->common.started) {
		ret = -EALREADY;
		goto unlock;
	}

	/*
	 * Stop is tracked in software: we keep the controller online (see
	 * can_gd32_start()) and only abort any in-flight transmissions. Sending
	 * is gated by data->common.started, so a stopped controller will not
	 * transmit.
	 */
	for (uint8_t i = 0U; i < CAN_GD32_TX_MAILBOX_NUM; i++) {
		can_mailbox_transmit_abort(can, CAN_GD32_TX_MAILBOX_START + i);
		can_gd32_signal_tx_complete(dev, &data->mb[i], -ENETDOWN);
		data->tx_mb_used[i] = 0U;
	}

	if (cfg->common.phy != NULL) {
		ret = can_transceiver_disable(cfg->common.phy);
		if (ret != 0) {
			LOG_ERR("failed to disable CAN transceiver (err %d)", ret);
			goto unlock;
		}
	}

	data->common.started = false;

unlock:
	k_mutex_unlock(&data->inst_mutex);
	return ret;
}

static void can_gd32_apply_mode_bits(uint32_t can, can_mode_t mode)
{
	switch (can_gd32_mode_to_hal(mode)) {
	case CAN_MONITOR_MODE:
		CAN_CTL1(can) &= ~CAN_CTL1_LSCMOD;
		CAN_CTL1(can) |= CAN_CTL1_MMOD;
		break;
	case CAN_LOOPBACK_SILENT_MODE:
		CAN_CTL1(can) &= ~CAN_CTL1_MMOD;
		CAN_CTL0(can) &= ~CAN_CTL0_SRDIS;
		CAN_FDCTL(can) &= ~CAN_FDCTL_TDCEN;
		CAN_CTL1(can) |= CAN_CTL1_LSCMOD;
		break;
	case CAN_NORMAL_MODE:
	default:
		CAN_CTL1(can) &= ~(CAN_CTL1_LSCMOD | CAN_CTL1_MMOD);
		break;
	}
}

static int can_gd32_set_mode(const struct device *dev, can_mode_t mode)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	can_mode_t supported = CAN_MODE_LOOPBACK | CAN_MODE_LISTENONLY;

#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	supported |= CAN_MODE_FD;
#endif

	if (IS_ENABLED(CONFIG_CAN_MANUAL_RECOVERY_MODE)) {
		supported |= CAN_MODE_MANUAL_RECOVERY;
	}

	if ((mode & ~supported) != 0) {
		LOG_ERR("unsupported mode: 0x%08x", mode);
		return -ENOTSUP;
	}

