GD32-MCU-IOT/gd32_zephyr/drivers/can/can_gd32_v2.c
	if (data->common.started) {
		return -EBUSY;
	}

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (!data->hw_online) {
		can_gd32_freeze(can);
		can_gd32_apply_mode_bits(can, mode);
		data->hw_mode = mode;
	}
	data->common.mode = mode;

	k_mutex_unlock(&data->inst_mutex);
	return 0;
}

static int can_gd32_set_timing(const struct device *dev, const struct can_timing *timing)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (data->common.started) {
		k_mutex_unlock(&data->inst_mutex);
		return -EBUSY;
	}

	CAN_BT(can) &= ~(CAN_BT_PBS2 | CAN_BT_PBS1 | CAN_BT_PTS | CAN_BT_SJW | CAN_BT_BAUDPSC);
	CAN_BT(can) |= BT_PBS2((uint32_t)timing->phase_seg2 - 1U) |
		       BT_PBS1((uint32_t)timing->phase_seg1 - 1U) |
		       BT_PTS((uint32_t)timing->prop_seg - 1U) |
		       BT_SJW((uint32_t)timing->sjw - 1U) |
		       BT_BAUDPSC((uint32_t)timing->prescaler - 1U);

	k_mutex_unlock(&data->inst_mutex);
	return 0;
}

#ifdef CONFIG_CAN_GD32_CAN_V2_FD
static int can_gd32_set_timing_data(const struct device *dev, const struct can_timing *timing)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (data->common.started) {
		k_mutex_unlock(&data->inst_mutex);
		return -EBUSY;
	}

	CAN_FDBT(can) &= ~(CAN_FDBT_DPBS2 | CAN_FDBT_DPBS1 | CAN_FDBT_DPTS | CAN_FDBT_DSJW |
			   CAN_FDBT_DBAUDPSC);
	CAN_FDBT(can) |= FDBT_DPBS2((uint32_t)timing->phase_seg2 - 1U) |
			 FDBT_DPBS1((uint32_t)timing->phase_seg1 - 1U) |
			 FDBT_DPTS((uint32_t)timing->prop_seg) |
			 FDBT_DSJW((uint32_t)timing->sjw - 1U) |
			 FDBT_DBAUDPSC((uint32_t)timing->prescaler - 1U);

	k_mutex_unlock(&data->inst_mutex);
	return 0;
}

/*
 * Enable CAN-FD mode and configure the common FD parameters. Mailbox data
 * size is set to 64 bytes (the maximum) and ISO CAN FD protocol is selected.
 * Bit-rate switch (CAN_FDCTL_BRSEN) and TDC are enabled unconditionally here;
 * per-frame BRS is governed by CAN_FRAME_BRS in the TX/RX descriptors, and
 * TDC only takes effect when BRSEN is exercised by the hardware.
 */
static void can_gd32_enable_fd(uint32_t can)
{
	CAN_CTL0(can) |= CAN_CTL0_FDEN;
	CAN_CTL2(can) |= CAN_CTL2_ISO;

	CAN_FDCTL(can) |= CAN_MAILBOX_DATA_SIZE_64_BYTES | CAN_FDCTL_BRSEN;
}
#endif /* CONFIG_CAN_GD32_CAN_V2_FD */

/*
 * Map a CAN peripheral base address to its RCU clock-source index.
 */
static can_idx_enum can_gd32_can_idx(uint32_t reg)
{
	if (reg == CAN2) {
		return IDX_CAN2;
	}

	if (reg == CAN1) {
		return IDX_CAN1;
	}

	return IDX_CAN0;
}

static int can_gd32_get_core_clock(const struct device *dev, uint32_t *rate)
{
	ARG_UNUSED(dev);

	/*
	 * The CAN kernel clock is fed from CK_APB2 (selected in can_gd32_init()
	 * via rcu_can_clock_config()). The generic GD32 clock controller cannot
	 * report this rate because the CAN enable bit lives in the additional
	 * APB2 register, so query the HAL directly.
	 */
	*rate = rcu_clock_freq_get(CK_APB2);
	if (*rate == 0U) {
		LOG_ERR("Failed to get CAN core clock rate");
		return -EIO;
	}

	return 0;
}

static int can_gd32_get_max_filters(const struct device *dev, bool ide)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(ide);

	return CONFIG_CAN_GD32_CAN_V2_MAX_ID_FILTER;
}

static int can_gd32_send(const struct device *dev, const struct can_frame *frame,
			 k_timeout_t timeout, can_tx_callback_t callback, void *user_data)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	struct can_gd32_mailbox *mb;
	can_mailbox_descriptor_struct tx_msg;
	size_t data_length = can_dlc_to_bytes(frame->dlc);
	uint8_t mb_idx = CAN_GD32_TX_MAILBOX_NUM;
	int ret;

	LOG_DBG("Sending %zu bytes on %s. Id: 0x%x, ID type: %s, Remote Frame: %s", data_length,
		dev->name, frame->id, (frame->flags & CAN_FRAME_IDE) != 0 ? "extended" : "standard",
		(frame->flags & CAN_FRAME_RTR) != 0 ? "yes" : "no");

	__ASSERT(frame->dlc == 0U || frame->data != NULL, "Dataptr is null");

#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	/* ESI is set by the hardware based on the node's error state; the
	 * Zephyr API forbids setting it explicitly on a TX frame.
	 */
	if ((frame->flags & CAN_FRAME_ESI) != 0) {
		LOG_ERR("ESI flag cannot be set on TX frame");
		return -ENOTSUP;
	}

	if ((frame->flags & ~(CAN_FRAME_IDE | CAN_FRAME_RTR | CAN_FRAME_FDF | CAN_FRAME_BRS)) !=
	    0) {
		LOG_ERR("unsupported CAN frame flags 0x%02x", frame->flags);
		return -ENOTSUP;
	}

	/*
	 * CONFIG_CAN_GD32_CAN_V2_FD only means the controller is capable of FD;
	 * whether FD frames may actually be sent depends on the mode the
	 * controller is currently running in (set via can_set_mode()).
	 */
	if ((data->common.mode & CAN_MODE_FD) == 0U &&
	    ((frame->flags & (CAN_FRAME_FDF | CAN_FRAME_BRS)) != 0U)) {
		LOG_ERR("CAN FD format not supported in non-FD mode");
		return -ENOTSUP;
	}

	if ((frame->flags & CAN_FRAME_FDF) != 0U) {
		if (frame->dlc > CANFD_MAX_DLC) {
			LOG_ERR("DLC of %d exceeds max FD DLC", frame->dlc);
			return -EINVAL;
		}
	} else {
		if (frame->dlc > CAN_MAX_DLC) {
			LOG_ERR("DLC of %d for non-FD format frame", frame->dlc);
			return -EINVAL;
		}
	}
#else
	if ((frame->flags & ~(CAN_FRAME_IDE | CAN_FRAME_RTR)) != 0) {
		LOG_ERR("unsupported CAN frame flags 0x%02x", frame->flags);
		return -ENOTSUP;
	}

	if (frame->dlc > CAN_MAX_DLC) {
		LOG_ERR("DLC of %d for non-FD format frame", frame->dlc);
		return -EINVAL;
	}
#endif

	if (!data->common.started) {
		return -ENETDOWN;
	}

	if (CAN_ERR1(can) & CAN_ERR1_BOF) {
		return -ENETUNREACH;
	}

	ret = k_sem_take(&data->tx_sem, timeout);
	if (ret != 0) {
		return -EAGAIN;
	}

	k_mutex_lock(&data->tx_mtx, K_FOREVER);

	for (uint8_t i = 0U; i < CAN_GD32_TX_MAILBOX_NUM; i++) {
		if (data->tx_mb_used[i] == 0U) {
			data->tx_mb_used[i] = 1U;
			mb_idx = i;
			break;
		}
	}

	if (mb_idx == CAN_GD32_TX_MAILBOX_NUM) {
		k_mutex_unlock(&data->tx_mtx);
		k_sem_give(&data->tx_sem);
		LOG_DBG("Transmit buffer full");
		return -EAGAIN;
	}

	mb = &data->mb[mb_idx];
	mb->tx_callback = callback;
	mb->callback_arg = user_data;

