GD32-MCU-IOT/gd32_zephyr/drivers/can/can_gd32_v2.c
	memset(&tx_msg, 0, sizeof(tx_msg));
	tx_msg.code = CAN_MB_TX_STATUS_DATA;
	tx_msg.data_bytes = data_length;
	tx_msg.ide = (frame->flags & CAN_FRAME_IDE) != 0 ? 1U : 0U;
	tx_msg.rtr = (frame->flags & CAN_FRAME_RTR) != 0 ? 1U : 0U;
	tx_msg.id = frame->id;
#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	tx_msg.fdf = (frame->flags & CAN_FRAME_FDF) != 0 ? 1U : 0U;
	tx_msg.brs = (frame->flags & CAN_FRAME_BRS) != 0 ? 1U : 0U;
#endif
#if defined(CONFIG_SOC_GD32H75E)
	/* GD32H75E HAL: mailbox descriptor `data` is an inline uint8_t[64] array */
	memcpy(tx_msg.data, frame->data, data_length);
#else
	tx_msg.data = (uint32_t *)frame->data_32;
#endif

	can_mailbox_config(can, CAN_GD32_TX_MAILBOX_START + mb_idx, &tx_msg);

	k_mutex_unlock(&data->tx_mtx);
	return 0;
}

static int can_gd32_set_filter(const struct device *dev, const struct can_filter *filter)
{
	struct can_gd32_data *data = dev->data;
	int filter_id = -ENOSPC;

	for (int i = 0; i < CONFIG_CAN_GD32_CAN_V2_MAX_ID_FILTER; i++) {
		if (data->rx_cb[i] == NULL) {
			filter_id = i;
			break;
		}
	}

	if (filter_id < 0) {
		LOG_WRN("No free filter left");
		return -ENOSPC;
	}

	LOG_DBG("Adding filter_id %d, CAN ID: 0x%x, mask: 0x%x", filter_id, filter->id,
		filter->mask);

	/*
	 * Store the filter for the software acceptance matching performed in
	 * can_gd32_rx_mailbox_isr(). The RX mailboxes are all configured to
	 * accept every frame (see can_gd32_init(): CAN_RMPUBF is all-don't-care)
	 * so no hardware filter table needs to be touched here.
	 */
	data->filters[filter_id] = *filter;

	return filter_id;
}

static int can_gd32_add_rx_filter(const struct device *dev, can_rx_callback_t cb, void *cb_arg,
				  const struct can_filter *filter)
{
	struct can_gd32_data *data = dev->data;
	int filter_id;

	if ((filter->flags & ~(CAN_FILTER_IDE)) != 0) {
		LOG_ERR("unsupported CAN filter flags 0x%02x", filter->flags);
		return -ENOTSUP;
	}

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	filter_id = can_gd32_set_filter(dev, filter);
	if (filter_id >= 0) {
		data->rx_cb[filter_id] = cb;
		data->cb_arg[filter_id] = cb_arg;
	}

	k_mutex_unlock(&data->inst_mutex);
	return filter_id;
}

static void can_gd32_remove_rx_filter(const struct device *dev, int filter_id)
{
	struct can_gd32_data *data = dev->data;

	__ASSERT_NO_MSG(filter_id >= 0 && filter_id < CONFIG_CAN_GD32_CAN_V2_MAX_ID_FILTER);

	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	if (filter_id < CONFIG_CAN_GD32_CAN_V2_MAX_ID_FILTER) {
		data->rx_cb[filter_id] = NULL;
		data->cb_arg[filter_id] = NULL;
		memset(&data->filters[filter_id], 0, sizeof(data->filters[filter_id]));

		LOG_DBG("Removing filter_id %d", filter_id);
	}

	k_mutex_unlock(&data->inst_mutex);
}

static void can_gd32_set_state_change_callback(const struct device *dev,
					       can_state_change_callback_t cb, void *user_data)
{
	struct can_gd32_data *data = dev->data;

	data->common.state_change_cb = cb;
	data->common.state_change_cb_user_data = user_data;
}

#ifdef CONFIG_CAN_MANUAL_RECOVERY_MODE
static int can_gd32_recover(const struct device *dev, k_timeout_t timeout)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	int ret = -EAGAIN;
	int64_t start_time;

	if (!data->common.started) {
		return -ENETDOWN;
	}

	if ((data->common.mode & CAN_MODE_MANUAL_RECOVERY) == 0U) {
		return -ENOTSUP;
	}

	if (!(CAN_ERR1(can) & CAN_ERR1_BOF)) {
		return 0;
	}

	if (k_mutex_lock(&data->inst_mutex, K_FOREVER)) {
		return -EAGAIN;
	}

	ret = can_gd32_enter_init_mode(can);
	if (ret) {
		goto done;
	}

	can_gd32_unfreeze(can);

	start_time = k_uptime_ticks();
	while (CAN_ERR1(can) & CAN_ERR1_BOF) {
		if (!K_TIMEOUT_EQ(timeout, K_FOREVER) &&
		    k_uptime_ticks() - start_time >= timeout.ticks) {
			goto done;
		}
	}

	ret = 0;

done:
	k_mutex_unlock(&data->inst_mutex);
	return ret;
}
#endif /* CONFIG_CAN_MANUAL_RECOVERY_MODE */

static void can_gd32_enable_interrupts(uint32_t can)
{
	for (uint8_t i = 0U; i < CAN_GD32_RX_MAILBOX_NUM; i++) {
		can_interrupt_enable(can, CAN_INT_MB0 + CAN_GD32_RX_MAILBOX_START + i);
	}
	for (uint8_t i = 0U; i < CAN_GD32_TX_MAILBOX_NUM; i++) {
		can_interrupt_enable(can, CAN_INT_MB0 + CAN_GD32_TX_MAILBOX_START + i);
	}
	can_interrupt_enable(can, CAN_INT_BUSOFF);
	can_interrupt_enable(can, CAN_INT_ERR_SUMMARY);
}

static int can_gd32_init(const struct device *dev)
{
	const struct can_gd32_config *cfg = dev->config;
	struct can_gd32_data *data = dev->data;
	uint32_t can = cfg->reg;
	struct can_timing timing;
	int ret;

	k_mutex_init(&data->inst_mutex);
	k_mutex_init(&data->tx_mtx);
	k_sem_init(&data->tx_sem, CAN_GD32_TX_MAILBOX_NUM, CAN_GD32_TX_MAILBOX_NUM);

	if (cfg->common.phy != NULL) {
		if (!device_is_ready(cfg->common.phy)) {
			LOG_ERR("CAN transceiver not ready");
			return -ENODEV;
		}
	}

	if (!device_is_ready(GD32_CLOCK_CONTROLLER)) {
		LOG_ERR("clock controller not ready");
		return -ENODEV;
	}

	ret = clock_control_on(GD32_CLOCK_CONTROLLER, (clock_control_subsys_t *)&cfg->pclken);
	if (ret != 0) {
		LOG_ERR("Could not enable CAN clock (%d)", ret);
		return -EIO;
	}

	/*
	 * Select CK_APB2 as the CAN kernel clock source. Without a running
	 * kernel clock the controller cannot leave inactive mode, and
	 * can_gd32_get_core_clock() reports the same source.
	 */
	rcu_can_clock_config(can_gd32_can_idx(cfg->reg), RCU_CANSRC_APB2);

	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("CAN pinctrl setup failed (%d)", ret);
		return ret;
	}

	/*
	 * Wake the controller from reset / disable state before the real
	 * enter_init_mode below. See can_gd32_leave_sleep_mode() for details.
	 */
	can_gd32_leave_sleep_mode(can);

	ret = can_gd32_enter_init_mode(can);
	if (ret) {
		LOG_ERR("Failed to enter init mode");
		return ret;
	}

	timing.sjw = cfg->sjw;
	if (cfg->sample_point && USE_SP_ALGO) {
		ret = can_calc_timing(dev, &timing, cfg->bitrate, cfg->sample_point);
		if (ret < 0) {
			LOG_ERR("Can't find timing for given param");
			return -EIO;
		}
		LOG_DBG("Presc: %d, TS1: %d, TS2: %d", timing.prescaler, timing.phase_seg1,
			timing.phase_seg2);
		LOG_DBG("Sample-point err : %d", ret);
	} else {
		timing.prop_seg = cfg->prop_seg;
		timing.phase_seg1 = cfg->phase_seg1;
		timing.phase_seg2 = cfg->phase_seg2;
		timing.prescaler = 1U;
	}

	ret = can_gd32_set_timing(dev, &timing);
	if (ret) {
		return ret;
	}

#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	/*
	 * Configure the data-phase (FDBT) timing up front. can_gd32_enable_fd()
	 * below unconditionally enables CAN_FDCTL_BRSEN, and without this the
	 * data-phase timing register keeps its power-on-reset value; the first
	 * BRS frame actually transmitted would then use a bogus bit rate and
	 * drive the controller bus-off.
	 */
	{
		struct can_timing timing_data;

		timing_data.sjw = cfg->sjw_data;
		if (cfg->sample_point_data) {
			ret = can_calc_timing_data(dev, &timing_data, cfg->bitrate_data,
						   cfg->sample_point_data);
			if (ret < 0) {
				LOG_ERR("Can't find data-phase timing for given param");
				return -EIO;
			}
			LOG_DBG("Data Presc: %d, TS1: %d, TS2: %d", timing_data.prescaler,
				timing_data.phase_seg1, timing_data.phase_seg2);
		} else {
			timing_data.prop_seg = cfg->prop_seg_data;
			timing_data.phase_seg1 = cfg->phase_seg1_data;
			timing_data.phase_seg2 = cfg->phase_seg2_data;
			timing_data.prescaler = 1U;
		}

