GD32-MCU-IOT/gd32_zephyr/drivers/can/can_gd32_v2.c
		ret = can_gd32_set_timing_data(dev, &timing_data);
		if (ret) {
			return ret;
		}
	}
#endif /* CONFIG_CAN_GD32_CAN_V2_FD */

	/*
	 * This CAN core's classic RX FIFO (RFEN) and CAN-FD mailbox mode (FDEN)
	 * are mutually exclusive in hardware (the vendor's own can_fd_config()
	 * clears RFEN, and can_rx_fifo_config() clears FDEN -- and GD32H7's own
	 * demos never use the FIFO at all, classic or FD). So receive via a
	 * small pool of individual "accept all" RX mailboxes instead, for both
	 * classic and FD builds: CAN_RMPUBF is the public ID/IDE/RTR filter
	 * mask shared by all individual (non-FIFO) RX mailboxes; clearing it
	 * makes every bit "don't care", and CAN_CTL2_IDERTR_RMF puts IDE/RTR
	 * under that same mask instead of always being strictly compared.
	 * Acceptance is refined in software by can_gd32_rx_mailbox_isr()
	 * against data->filters[].
	 */
	CAN_CTL0(can) &= ~CAN_CTL0_RFEN;
	CAN_CTL2(can) |= CAN_CTL2_IDERTR_RMF;
	CAN_RMPUBF(can) = 0x00000000U;

	for (uint8_t i = 0U; i < CAN_GD32_RX_MAILBOX_NUM; i++) {
		can_gd32_rx_mailbox_rearm(can, CAN_GD32_RX_MAILBOX_START + i);
	}

#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	/*
	 * Enable FD mode. Since the RX FIFO is never configured on this driver
	 * anymore, there is no FDEN/RFEN ordering constraint left to worry
	 * about.
	 */
	can_gd32_enable_fd(can);

	data->fd_enabled = true;
#else
	data->fd_enabled = false;
#endif

	ret = can_gd32_set_mode(dev, CAN_MODE_NORMAL);
	if (ret) {
		return ret;
	}

	(void)can_gd32_get_state(dev, &data->state, NULL);

	cfg->config_irq(can);

	return 0;
}

static DEVICE_API(can, can_api_funcs) = {
	.get_capabilities = can_gd32_get_capabilities,
	.start = can_gd32_start,
	.stop = can_gd32_stop,
	.set_mode = can_gd32_set_mode,
	.set_timing = can_gd32_set_timing,
	.send = can_gd32_send,
	.add_rx_filter = can_gd32_add_rx_filter,
	.remove_rx_filter = can_gd32_remove_rx_filter,
	.get_state = can_gd32_get_state,
#ifdef CONFIG_CAN_MANUAL_RECOVERY_MODE
	.recover = can_gd32_recover,
#endif
	.set_state_change_callback = can_gd32_set_state_change_callback,
	.get_core_clock = can_gd32_get_core_clock,
	.get_max_filters = can_gd32_get_max_filters,
#ifdef CONFIG_CAN_GD32_CAN_V2_FD
	.set_timing_data = can_gd32_set_timing_data,
	.timing_data_min = {
			.sjw = 0x01,
			.prop_seg = 0x00,
			.phase_seg1 = 0x01,
			.phase_seg2 = 0x01,
			.prescaler = 0x01,
		},
	.timing_data_max = {
			.sjw = 0x08,
			.prop_seg = 0x20,
			.phase_seg1 = 0x08,
			.phase_seg2 = 0x08,
			.prescaler = 0x400,
		},
#endif
	.timing_min = {
			.sjw = 0x01,
			.prop_seg = 0x01,
			.phase_seg1 = 0x01,
			.phase_seg2 = 0x01,
			.prescaler = 0x01,
		},
	.timing_max = {
			.sjw = 0x20,
			.prop_seg = 0x40,
			.phase_seg1 = 0x20,
			.phase_seg2 = 0x20,
			.prescaler = 0x400,
		},
};

#define CAN_GD32_IRQ_INST(inst)                                                                    \
	static void config_can_##inst##_irq(uint32_t can)                                          \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, wake_up, irq),                               \
			    DT_INST_IRQ_BY_NAME(inst, wake_up, priority), can_gd32_wake_up_isr,    \
			    DEVICE_DT_INST_GET(inst), 0);                                          \
		irq_enable(DT_INST_IRQ_BY_NAME(inst, wake_up, irq));                               \
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, message_buffer, irq),                        \
			    DT_INST_IRQ_BY_NAME(inst, message_buffer, priority),                   \
			    can_gd32_message_buffer_isr, DEVICE_DT_INST_GET(inst), 0);             \
		irq_enable(DT_INST_IRQ_BY_NAME(inst, message_buffer, irq));                        \
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, bus_off, irq),                               \
			    DT_INST_IRQ_BY_NAME(inst, bus_off, priority), can_gd32_bus_off_isr,    \
			    DEVICE_DT_INST_GET(inst), 0);                                          \
		irq_enable(DT_INST_IRQ_BY_NAME(inst, bus_off, irq));                               \
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, fast_error, irq),                            \
			    DT_INST_IRQ_BY_NAME(inst, fast_error, priority),                       \
			    can_gd32_fast_error_isr, DEVICE_DT_INST_GET(inst), 0);                 \
		irq_enable(DT_INST_IRQ_BY_NAME(inst, fast_error, irq));                            \
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, error, irq),                                 \
			    DT_INST_IRQ_BY_NAME(inst, error, priority), can_gd32_error_isr,        \
			    DEVICE_DT_INST_GET(inst), 0);                                          \
		irq_enable(DT_INST_IRQ_BY_NAME(inst, error, irq));                                 \
		can_gd32_enable_interrupts(can);                                                   \
	}

#define CAN_GD32_CONFIG_INST(inst)                                                                 \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
	static const struct can_gd32_config can_gd32_cfg_##inst = {                                \
		.common = CAN_DT_DRIVER_CONFIG_INST_GET(inst, 0, 1000000),                         \
		.reg = DT_INST_REG_ADDR(inst),                                                     \
		.bitrate = DT_INST_PROP(inst, bitrate),                                            \
		.sample_point = DT_INST_PROP_OR(inst, sample_point, 0),                            \
		.sjw = DT_INST_PROP_OR(inst, sjw, 1),                                              \
		.prop_seg = DT_INST_PROP_OR(inst, prop_seg, 1),                                    \
		.phase_seg1 = DT_INST_PROP_OR(inst, phase_seg1, 1),                                \
		.phase_seg2 = DT_INST_PROP_OR(inst, phase_seg2, 1),                                \
		.pclken =                                                                          \
			{                                                                          \
				.enr = DT_INST_CLOCKS_CELL(inst, id),                              \
				.bus = DT_INST_CLOCKS_CELL(inst, id),                              \
			},                                                                         \
		.config_irq = config_can_##inst##_irq,                                             \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                      \
		IF_ENABLED(CONFIG_CAN_GD32_CAN_V2_FD,					       \
			   (.bitrate_data = DT_INST_PROP_OR(inst, bitrate_data, 0),		   \
			    .sample_point_data = DT_INST_PROP_OR(inst, sample_point_data, 0),	   \
			    .sjw_data = DT_INST_PROP_OR(inst, sjw_data, 1),			   \
			    .prop_seg_data = DT_INST_PROP_OR(inst, prop_seg_data, 1),		   \
			    .phase_seg1_data = DT_INST_PROP_OR(inst, phase_seg1_data, 1),	   \
			    .phase_seg2_data = DT_INST_PROP_OR(inst, phase_seg2_data, 1),)) };

#define CAN_GD32_DATA_INST(inst) static struct can_gd32_data can_gd32_dev_data_##inst;

#define CAN_GD32_DEFINE_INST(inst)                                                                 \
	DEVICE_DT_INST_DEFINE(inst, &can_gd32_init, NULL, &can_gd32_dev_data_##inst,               \
			      &can_gd32_cfg_##inst, POST_KERNEL, CONFIG_CAN_INIT_PRIORITY,         \
			      &can_api_funcs);

#define CAN_GD32_INST(inst)                                                                        \
	CAN_GD32_IRQ_INST(inst)                                                                    \
	CAN_GD32_CONFIG_INST(inst)                                                                 \
	CAN_GD32_DATA_INST(inst)                                                                   \
	CAN_GD32_DEFINE_INST(inst)

DT_INST_FOREACH_STATUS_OKAY(CAN_GD32_INST)
